```
data.aws_iam_policy_document.lambda_assume: Reading...
data.aws_iam_policy_document.eventbridge_assume: Reading...
data.aws_iam_policy.lambda_basic: Reading...
aws_scheduler_schedule_group.schedule_group: Refreshing state... [id=sentinel-prod-eventbridge-group-use1]
aws_cloudwatch_log_group.log_group: Refreshing state... [id=/aws/lambda/sentinel-prod-lambda-function-use1]
aws_s3_bucket_versioning.backend: Refreshing state... [id=sentinel-prod-s3-bucket-use1]
aws_s3_bucket.backend: Refreshing state... [id=sentinel-prod-s3-bucket-use1]
data.aws_iam_policy_document.eventbridge_assume: Read complete after 0s [id=52247394]
data.aws_iam_policy_document.lambda_assume: Read complete after 0s [id=2690255455]
aws_iam_role.eventbridge: Refreshing state... [id=sentinel-prod-iam-role-eventbridge-use1]
aws_iam_role.lambda: Refreshing state... [id=sentinel-prod-iam-role-lambda-use1]
data.aws_iam_policy.lambda_basic: Read complete after 1s [id=arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole]
aws_iam_role_policy_attachment.lambda_logging_policy_role_attachment: Refreshing state... [id=sentinel-prod-iam-role-lambda-use1-20250611231657841600000001]
aws_lambda_function.lambda: Refreshing state... [id=sentinel-prod-lambda-function-use1]
aws_iam_policy.eventbridge: Refreshing state... [id=arn:aws:iam::469264374601:policy/sentinel-prod-iam-policy-eventbridge-use1]
aws_scheduler_schedule.schedule: Refreshing state... [id=sentinel-prod-eventbridge-group-use1/sentinel-prod-eventbridge-schedule-use1]
aws_iam_role_policy_attachment.eventbridge: Refreshing state... [id=sentinel-prod-iam-role-eventbridge-use1-20250609235841095800000001]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.eventbridge will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "eventbridge" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:lambda:us-east-1:469264374601:function:sentinel-prod-lambda-function-use1",
            ]
        }
    }

  # aws_iam_policy.eventbridge will be updated in-place
  ~ resource "aws_iam_policy" "eventbridge" {
        id               = "arn:aws:iam::469264374601:policy/sentinel-prod-iam-policy-eventbridge-use1"
        name             = "sentinel-prod-iam-policy-eventbridge-use1"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:us-east-1:469264374601:function:sentinel-prod-lambda-function-use1"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # aws_lambda_function.lambda will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
      ~ filename                       = "./lambda_test.zip" -> "./lambda_a893f190ac1d2e9a4a00ae28ef34c789222d80c6.zip"
        id                             = "sentinel-prod-lambda-function-use1"
      ~ last_modified                  = "2025-06-11T01:37:46.000+0000" -> (known after apply)
      ~ source_code_hash               = "ZrPj2bVOCZiZlAz656U8XDM36oN5F1JqGqUQbx0l/NE=" -> "c/WkriapVK22z7d1gb9WRi0c5z+VAMMnTCnWO9ieMgg="
        tags                           = {}
        # (26 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```